<template>
  <div class="paddings">
    <p>Привет. Если будет время можешь макет с продуктами сделать, именно с одним товаром.И главную посмотреть что исправить</p>
  <p>Получается технически все готово, просто товары добавляешь и все. Получается если у товара новая категория она просто автоматом добавляеться, 
    а рисунок в категорию просто с последнего товара этой ептегории подтягиваеться.
  </p>
  <p>Главную тож скажешь че если переделать. </p>
  <p></p>
  </div>
</template>

<script lang="ts" setup>

</script>

<style>

</style>