<template>
<div class="p-5">
    <p>Если вкратце, магазин что я хотел сделать с товарами, по идее технически все готово, т.е можно добавитт в корзину,това при 
        поиске в инпут выдает товар и т.д.Но дизайном я не заморачивался пока от слова совсем.
    </p>
    <p>Т.е надо сохранив структру оставить добавить норм дизайн.Не прям вау а просто норм, тем более что у всех интернет магазов дизайн по моему говно</p>
    <p> Navbar,посмотри вверху две кнопки, default и mobile. когда щелкаешь на них
        навбар меняеться. Изначально мобайл хотел для мобильной версии сделать, а дефаулт для компа, но можно и мобильную подо все адаптировать.
    </p>
    <p>Итого надо дизайн товара по категориям, дизайн индивидуальных товаров. И на главной странице че нибудь. На корзину пох, сделаю подчеркнуто брутальной.</p>
    <p></p>
</div>
</template>

<script setup>
import { useProductsStore } from '~/stores/products';
import { storeToRefs } from 'pinia';
const store=useProductsStore()
const {products,mapped,categories}=storeToRefs(store)

</script>

